Backend/Ruby On Rails Authentication/app/controllers/registration_controller.rb

    def register
        user=User.create(user_params)
---
INSERT INTO `users` (`email`, `password_digest`) VALUES ('amanq@g.com', '$2a$12$S3ws9K791Og0N2hVRuug2uf874ww4xK94CdBo51Q/vmMCvGGKC7fu')